{
  "computer-language": "Я вже казав, що комп’ютер — це пристрій, який зберігає та обробляє дані, виконуючи обчислення? Створюєте ви штучний інтелект, здатний переграти людину в шахи, або щось простіше, як-от відеогру, чим більше обчислювальної потужності ви маєте, тим більші ваші можливості. У цьому уроці ви зрозумієте, що комп’ютер обчислює і як саме. У нас є математична задача. Скільки буде 0 + 1? Ви миттєво підрахуєте, що 1. Та уявіть, що вам потрібно зробити 100 таких же простих обчислень. Ви на це здатні, і якщо будете уважні, не зробите помилок. А якщо вам потрібно зробити 1000 таких обчислень? А якщо мільйон? Або мільярд? Саме це й робить комп’ютер. Комп’ютер просто порівнює 1 та 0, але мільйони чи мільярди разів на секунду. Овва! Засіб спілкування комп’ютера називається двійковою системою, що також відома як двійкова система числення. Тобто він говорить лише одиницями та нулями. Ви подумаєте: «Гаразд, мій комп’ютер знає лише одиниці й нулі. Як з ним спілкуватися?» Уявіть це ось так. Ми використовуємо літери, щоб скласти слова й дати їм значення. Літерами ми пишемо речення, абзаци й цілі історії. Те саме й з двійковою системою. Але замість A, B, C тощо ми маємо лише 0 та 1, щоб створювати слова й давати їм значення. Мовою комп’ютерів, ми групуємо двійкові комбінації у 8 чисел або бітів. Фактично, біт — це двійкова цифра. Раніше ми використовували 8 біт, бо на початку комп’ютерної ери апаратні засоби використовували двійкову систему числення. Коли ми підносили 2 до 8 степеня, отримували достатній діапазон значень для всіх обчислень. Тоді використовувалася будь-яка кількість біт, але зрештою 8-бітні групи стали галузевим стандартом, який існує зараз. Запам’ятайте, що група з 8 біт називається байтом. Отже, байт нулів і одиниць міг виглядати як 10011011. Кожен байт передає один символ, і ми можемо мати 256 можливих значень завдяки двійковій системі числення. Комп’ютерною мовою цей байт може означати щось на кшталт літери С. Ось так народилася комп’ютерна мова."
}
